app/Http/Controllers/API/AuthController.php


        $course = Course::
        whereIn('mdl_course.id', function($q) use ($user){
            $q->select('e.courseid')
            ->from('mdl_enrol as e')
            ->join('mdl_user_enrolments as ue', function ($join) use ($user) {
                $join->on('ue.enrolid', '=', 'e.id')
                    ->where('ue.userid', '=', $user->id);
            })
            ->join('mdl_course as c', 'c.id', '=', 'e.courseid')
            ->where('ue.status', '=', '0')
            ->where('e.status', '=', '0');
---
select "mdl_course"."id" from "mdl_course" where "mdl_course"."id" in (select "e"."courseid" from "mdl_enrol" as "e" inner join "mdl_user_enrolments" as "ue" on "ue"."enrolid" = "e"."id" and "ue"."userid" = 58854 inner join "mdl_course" as "c" on "c"."id" = "e"."courseid" where "ue"."status" = '0' and "e"."status" = '0') limit 1


        Log::info($course);

        $ctx = Context::where('contextlevel', 50)->where('instanceid', $course->id)->first();
        $data = DB::connection('moodle_mysql')->table('mdl_role_assignments as ra')
        ->join('mdl_role as r', 'r.id', '=', 'ra.roleid')
        ->where('ra.contextid', $ctx->id)
        ->where('ra.userid', auth()->user()->id)
        ->select(
            'r.shortname as role',
        )
        ->first();
---
select * from "mdl_context" where "contextlevel" = 50 and "instanceid" = 17488 limit 1
select "r"."shortname" as "role" from "mdl_role_assignments" as "ra" inner join "mdl_role" as "r" on "r"."id" = "ra"."roleid" where "ra"."contextid" = 464724 and "ra"."userid" = 58854 limit 1