app/Http/Controllers/API/CourseController.php

    public function getAllCourse(Request $request){
        $time = time();
        $course = Course::
        whereIn('mdl_course.id', function($q) use ($time, $request){
            $q->select('e.courseid')
            ->from('mdl_enrol as e')
            ->join('mdl_user_enrolments as ue', function ($join) use ($request) {
                $join->on('ue.enrolid', '=', 'e.id')
                    ->where('ue.userid', '=', $request->user()->id);
            })
            ->join('mdl_course as c', 'c.id', '=', 'e.courseid')
            ->where('ue.status', '=', '0')
            ->where('e.status', '=', '0')
            ->where('ue.timestart', '<=', $time)
            ->where(function ($query) use ($time) {
                $query->where('ue.timeend', '=', 0)
                        ->orWhere('ue.timeend', '>', $time);
            });
        })
        ->select(
            'mdl_course.*'
        )
        ->get();
---
select "mdl_course".* from "mdl_course" where "mdl_course"."id" in (select "e"."courseid" from "mdl_enrol" as "e" inner join "mdl_user_enrolments" as "ue" on "ue"."enrolid" = "e"."id" and "ue"."userid" = 5 inner join "mdl_course" as "c" on "c"."id" = "e"."courseid" where "ue"."status" = '0' and "e"."status" = '0' and "ue"."timestart" <= 1739869827 and ("ue"."timeend" = 0 or "ue"."timeend" > 1739869827))
select * from `mdl_course` where `mdl_course`.`id` in (select `e`.`courseid` from `mdl_enrol` as `e` inner join `mdl_user_enrolments` as `ue` on `ue`.`enrolid` = `e`.`id` and `ue`.`userid` = 7 inner join `mdl_course` as `c` on `c`.`id` = `e`.`courseid` where `ue`.`status` = '0' and `e`.`status` = '0' and `ue`.`timestart` <= 1737276633 and (`ue`.`timeend` = 0 or `ue`.`timeend` > 1737276633))

    public function getTopic(Request $request, $shortname){

        $sections = [];
        $course = Course::where('shortname', $shortname)->first();
        $courseSections = CourseSection::where('course', $course->id)->get();

        foreach($courseSections as $cs){

            $section = new stdClass();

            $section->id = $cs->id;
            $section->name = $cs->name;
            $section->section = $cs->section;
            $section->modules = [];

            if(!empty($cs->sequence)){

                $cmids = array_filter(explode(',', $cs->sequence), fn($value) => $value !== '');

                $courseModules = CourseModule::whereIn('id', $cmids)
                ->where('deletioninprogress', 0)
                ->where('course', $course->id)
                ->get();
---
select * from "mdl_course" where "shortname" = 'krs-1' limit 1
select * from "mdl_course_sections" where "course" = 2
select * from "mdl_course_modules" where "id" in ('1') and "deletioninprogress" = 0 and "course" = 2

                    $module->instance = $cm->instance;
                    $module->module = $cm->module;

                    $selectedModule = Module::find($cm->module);
---
select * from "mdl_modules" where "mdl_modules"."id" = 17 limit 1


                    if($selectedModule->name == 'resource'){

                        $file_ctx = DB::connection('moodle_mysql')->table('mdl_context')
                        ->where('instanceid', $cm->id)
                        ->where('contextlevel', 70)
                        ->first('id');

                        $files = DB::connection('moodle_mysql')->table('mdl_files')
                        ->where('contextid', $file_ctx->id)
                        ->where('component', 'mod_resource')
                        ->whereNotNull('mimetype')
                        ->whereNotNull('source')
                        ->orderBy('id')
                        ->get();
---
select "id" from "mdl_context" where "instanceid" = 4 and "contextlevel" = 70 limit 1
select * from "mdl_files" where "contextid" = 24 and "component" = 'mod_resource' and "mimetype" is not null and "source" is not null order by "id" asc

    public function getParticipants(Request $request, $shortname){

        $course = Course::where('shortname', $shortname)->first();

        $participants = DB::connection('moodle_mysql')->table('mdl_user')
        ->join('mdl_user_enrolments', 'mdl_user.id', '=', 'mdl_user_enrolments.userid')
        ->join('mdl_enrol', 'mdl_user_enrolments.enrolid', '=', 'mdl_enrol.id')
        ->where('mdl_enrol.courseid', $course->id)
        ->where('mdl_user_enrolments.status', 0)
        ->where('mdl_user.id', '!=', $request->user()->id)
        ->where('mdl_user.username', '!=','admin')
        ->select(
            'mdl_user.id',
            DB::raw("mdl_user.firstname || ' ' || mdl_user.lastname as fullname"),
            'mdl_user.username',
            'mdl_user.email',
            'mdl_user.picture'
        )
        ->get();
---
select * from "mdl_course" where "shortname" = 'krs-1' limit 1
select "mdl_user"."id", mdl_user.firstname || ' ' || mdl_user.lastname as fullname, "mdl_user"."username", "mdl_user"."email", "mdl_user"."picture" from "mdl_user" inner join "mdl_user_enrolments" on "mdl_user"."id" = "mdl_user_enrolments"."userid" inner join "mdl_enrol" on "mdl_user_enrolments"."enrolid" = "mdl_enrol"."id" where "mdl_enrol"."courseid" = 2 and "mdl_user_enrolments"."status" = 0 and "mdl_user"."id" != 5 and "mdl_user"."username" != 'admin'

    public function getAllCanImportCourse(Request $request){

        $course = Course::
        whereIn('mdl_course.id', function($q) use ($request){
            $q->select('e.courseid')
            ->from('mdl_enrol as e')
            ->join('mdl_user_enrolments as ue', function ($join) use ($request) {
                $join->on('ue.enrolid', '=', 'e.id')
                    ->where('ue.userid', '=', $request->user()->id);
            })
            ->join('mdl_course as c', 'c.id', '=', 'e.courseid')
            ->where('ue.status', '=', '0')
            ->where('e.status', '=', '0');
        })
        ->select(
            'mdl_course.id',
            'mdl_course.fullname',
            'mdl_course.shortname',
        )
        ->get();
---
select "mdl_course"."id", "mdl_course"."fullname", "mdl_course"."shortname" from "mdl_course" where "mdl_course"."id" in (select "e"."courseid" from "mdl_enrol" as "e" inner join "mdl_user_enrolments" as "ue" on "ue"."enrolid" = "e"."id" and "ue"."userid" = 58854 inner join "mdl_course" as "c" on "c"."id" = "e"."courseid" where "ue"."status" = '0' and "e"."status" = '0')

    public function getGrades(Request $request, $shortname){
        $course = Course::where('shortname', $shortname)->first();
---
select * from "mdl_course" where "shortname" = 'web-1' limit 1