app/Http/Controllers/API/DashboardController.php

select "c"."id" as "courseid", "c"."fullname", COUNT(DISTINCT cmc.id) as completed_activities, COUNT(DISTINCT cm.id) as total_activities, ROUND((COUNT(DISTINCT cmc.id) * 100.0) / COUNT(DISTINCT cm.id), 2) as completion_percentage from "mdl_course" as "c" inner join "mdl_course_modules" as "cm" on "cm"."course" = "c"."id" left join "mdl_course_modules_completion" as "cmc" on "cmc"."coursemoduleid" = "cm"."id" and "cmc"."userid" = 3 and "cmc"."completionstate" = 1 where "cm"."completion" > 0 and 0 = 1 group by "c"."id", "c"."fullname"
---
        Log::info($recent);

        $categories = CourseCategory::whereIn('id', $recent_course->pluck('category'))->get();
        $completionRate = DB::connection('moodle_mysql')->table('mdl_course as c')
        ->select([
            'c.id as courseid',
            'c.fullname',
            DB::raw('COUNT(DISTINCT cmc.id) as completed_activities'),
            DB::raw('COUNT(DISTINCT cm.id) as total_activities'),
            DB::raw('ROUND((COUNT(DISTINCT cmc.id) * 100.0) / COUNT(DISTINCT cm.id), 2) as completion_percentage')
        ])
        ->join('mdl_course_modules as cm', 'cm.course', '=', 'c.id')
        ->leftJoin('mdl_course_modules_completion as cmc', function($join) use ($request) {
            $join->on('cmc.coursemoduleid', '=', 'cm.id')
                ->where('cmc.userid', '=', $request->user()->id)
                ->where('cmc.completionstate', '=', 1);
        })
        ->where('cm.completion', '>', 0)
        ->whereIn('c.id', $recent_course->pluck('id')->toArray())
        ->groupBy(['c.id', 'c.fullname'])
        ->get();