app/Helpers/GlobalHelper.php

    static public function rebuildCourseCache($course_id){
        $course = Course::find($course_id);
        $course->update([
            'cacherev' => time(),
            'timemodified' => time()
        ]);
---
select * from "mdl_course" where "mdl_course"."id" = 2 limit 1
update "mdl_course" set "timemodified" = 1739860561, "cacherev" = 1739860561 where "id" = 2