app/Http/Controllers/API/Activity/ActivityController.php

select * from "mdl_course_modules" where "mdl_course_modules"."id" = '9' limit 1
select * from "mdl_modules" where "mdl_modules"."id" = 18 limit 1
select * from "mdl_course" where "shortname" = 'krs-1' limit 1
delete from "mdl_resource" where "id" = 6
update "mdl_course_modules" set "deletioninprogress" = 1 where "id" = 9
---
    public function destroy($shortname, $id){
        DB::beginTransaction();

        try {
            $cm = CourseModule::find($id);
            $selectedModule = Module::find($cm->module);
            $course = Course::where('shortname', $shortname)->first();
            switch ($selectedModule->name) {
                case 'url':
                    $mod_table = 'url';
                    break;
                case 'resource':
                    $mod_table = 'mdl_resource';
                    break;
                case 'attendances':
                    $mod_table = 'attendances';
                    break;
                case 'assign':
                    $mod_table = 'assignments';
                    break;
                case 'quiz':
                    $mod_table = 'quizzes';
                    break;
            }
            DB::table($mod_table)
            ->where('id', $cm->instance)
            ->delete();
            $cm->update(['deletioninprogress' => 1]);