app/Http/Controllers/API/Activity/AssignmentController.php

select * from "mdl_course" where "shortname" = 'web-1' limit 1
select * from "mdl_role" where "shortname" = 'student' limit 1
---
    public function detail(Request $request,$shortname, Assignment $assignment){

        $course = Course::where('shortname', $shortname)->first();
        $role = Role::where('shortname', 'student')->first();

select "mdl_user_enrolments"."userid" from "mdl_enrol" inner join "mdl_user_enrolments" on "mdl_user_enrolments"."enrolid" = "mdl_enrol"."id" where "mdl_enrol"."courseid" = 3 and "mdl_enrol"."roleid" = 5 and "mdl_user_enrolments"."userid" != 5
select "mdl_user"."id", "s"."id" as "assignment_submission_id", CONCAT(mdl_user.firstname,' ',mdl_user.lastname) as fullname, "mdl_user"."username" as "nim", "s"."timecreated", "s"."timemodified", "s"."status" from "mdl_user" left join "mdl_assign_submission" as "s" on "s"."userid" = "mdl_user"."id" and "s"."assignment" = 4 where "mdl_user"."id" in (2, 3)
---
                $instance->type = 'file';
            }

            $studentIds = DB::connection('moodle_mysql')->table('mdl_enrol')
                ->where('mdl_enrol.courseid', $course->id)
                ->where('mdl_enrol.roleid', $role->id)
                ->where('mdl_user_enrolments.userid', '!=',$request->user()->id)
                ->join('mdl_user_enrolments', 'mdl_user_enrolments.enrolid', '=', 'mdl_enrol.id')
                ->pluck('mdl_user_enrolments.userid');

            Log::info($studentIds);

            $students = User::query()
            ->whereIn('mdl_user.id', $studentIds)
            ->leftJoin('mdl_assign_submission as s', function($q) use ($assignment) {
                $q->on('s.userid', '=', 'mdl_user.id')
                ->where('s.assignment', $assignment->id);
            })
            ->select(
                'mdl_user.id',
                's.id as assignment_submission_id',
                DB::raw("CONCAT(mdl_user.firstname,' ',mdl_user.lastname) as fullname"),
                'mdl_user.username as nim',
                's.timecreated',
                's.timemodified',
                's.status',
            )
            ->get();

select count("s"."userid") as aggregate from "mdl_assign_submission" as "s" where "s"."latest" = 1 and "s"."assignment" = 4 and "s"."timemodified" is not null and "s"."status" = 'submitted' and "s"."userid" in (2, 5)
select count("s"."userid") as aggregate from "mdl_assign_submission" as "s" left join "mdl_assign_grades" as "g" on "s"."assignment" = "g"."assignment" and "s"."userid" = "g"."userid" and "s"."attemptnumber" = "g"."attemptnumber" where "s"."userid" in (2, 5) and "s"."latest" = 1 and "s"."assignment" = 4 and "s"."status" = 'submitted' and "s"."timemodified" is not null and ("s"."timemodified" >= g.timemodified or "g"."timemodified" is null or "g"."grade" is null)
---
                ];
            });

            $instance->submitted_count = DB::connection('moodle_mysql')
            ->table('mdl_assign_submission as s')
            ->where('s.latest', 1)
            ->where('s.assignment', $assignment->id)
            ->whereNotNull('s.timemodified')
            ->where('s.status', 'submitted')
            ->whereIn('s.userid', $studentIds)
            ->count('s.userid');

            $instance->need_grading_count = DB::connection('moodle_mysql')
            ->table('mdl_assign_submission as s')
            ->leftJoin('mdl_assign_grades as g', function($q){
                $q->on('s.assignment', '=', 'g.assignment')
                ->on('s.userid', '=', 'g.userid')
                ->on('s.attemptnumber', '=', 'g.attemptnumber');
            })
            ->whereIn('s.userid', $studentIds)
            ->where('s.latest', 1)
            ->where('s.assignment', $assignment->id)
            ->where('s.status', 'submitted')
            ->whereNotNull('s.timemodified')
            ->where(function ($query) {
                $query->where('s.timemodified', '>=', DB::raw('g.timemodified'))
                    ->orWhereNull('g.timemodified')
                    ->orWhereNull('g.grade');
            })
            ->count('s.userid');

select * from "mdl_modules" where "name" = 'assign' limit 1
select * from "mdl_assign" where "mdl_assign"."id" = 4 limit 1
select * from "mdl_user" where "mdl_user"."id" = 3 limit 1
---
    public function getDetailGrading(Request $request,AssignmentSubmission $assignmentSubmission){
        $module = Module::where('name', 'assign')->first();
        $assignment = Assignment::find($assignmentSubmission->assignment);
        $user = User::find($assignmentSubmission->userid);

select "id" from "mdl_context" where "contextlevel" = 70 and "instanceid" = 15 limit 1
select * from "mdl_files" where "contextid" = 36 and "component" = 'assignsubmission_file' and "filearea" = 'submission_files' and "itemid" = 2 and "filename" != '.' order by "id" asc
---

        if($file_plugin){
            $type = 'file';
            $ctx_id = Context::where('contextlevel', 70)->where('instanceid', $courseModule->id)->first('id')->id;

            $files = DB::connection('moodle_mysql')->table('mdl_files')
            ->where('contextid', $ctx_id)
            ->where('component', 'assignsubmission_file')
            ->where('filearea', 'submission_files')
            ->where('itemid', $assignmentSubmission->id)
            ->where('filename', '!=', '.')
            ->orderBy('id')
            ->get();

select "grade" from "mdl_assign_grades" where "assignment" = 4 and "userid" = 3 limit 1
---
            }
        }

        $grade = AssignGrade::where('assignment', $assignment->id)
        ->where('userid', $user->id)->first('grade')->grade ?? 0;

select * from "mdl_assign_grades" where ("assignment" = 4 and "userid" = 3) limit 1
select * from "mdl_grade_items" where "iteminstance" = 4 and "itemmodule" = 'assign' and "courseid" = 3 limit 1
update "mdl_grade_grades" set "rawgrade" = '10', "finalgrade" = '10', "usermodified" = 5, "timemodified" = 1739891730 where "itemid" = 8 and "userid" = 3
---
    public function storeGrade(Request $request)
    {
        DB::beginTransaction();

        try {

            $assignGrade = AssignGrade::updateOrCreate(
                [
                    'assignment' => $request['assignment_id'],
                    'userid' => $request['student_id'],
                ],
                [
                    'timemodified' => time(),
                    'grade' => $request['grade'],
                    'grader' => auth()->user()->id,
                    'timecreated' => time(),
                ]
            );

            $gradeItem = GradeItem::where('iteminstance', $request['assignment_id'])
                ->where('itemmodule', 'assign')
                ->where('courseid', $request['course_id'])
                ->first();

            if (!$gradeItem) {
                return response()->json([
                    'message' => 'Item penilaian tidak ditemukan.',
                ], 404);
            }

            $gradeGrades = GradeGrades::where('itemid', $gradeItem->id)
                ->where('userid', $request['student_id'])
                ->update([
                    'rawgrade' => $request['grade'],
                    'finalgrade' => $request['grade'],
                    'usermodified' => auth()->user()->id,
                    'timemodified' => time(),
                ]);