app/Http/Controllers/API/Activity/AttendanceController.php

    public function getSession(Request $request,Attendance $attendance){

        $sessions = DB::connection('moodle_mysql')
        ->table('mdl_attendance_sessions')
        ->where('attendanceid', $attendance->id)
        ->get();

        $ctx = Context::where('contextlevel', 50)->where('instanceid', $attendance->course)->first();
        $data = DB::connection('moodle_mysql')->table('mdl_role_assignments as ra')
        ->join('mdl_role as r', 'r.id', '=', 'ra.roleid')
        ->where('ra.contextid', $ctx->id)
        ->where('ra.userid', $request->user()->id)
        ->select(
            'r.shortname as role',
        )
        ->first();
---
select * from `mdl_attendance_sessions` where `attendanceid` = 17
select * from `mdl_context` where `contextlevel` = 50 and `instanceid` = 9 limit 1
select `r`.`shortname` as `role` from `mdl_role_assignments` as `ra` inner join `mdl_role` as `r` on `r`.`id` = `ra`.`roleid` where `ra`.`contextid` = 309 and `ra`.`userid` = 8 limit 1

    public function getSessionDetail($shortname, $sessionId){

        $course = Course::where('shortname', $shortname)->first();

        $module = Module::where('name', 'attendance')->first();

        $role = Role::where('shortname', 'student')->first();

        $session = DB::connection('moodle_mysql')->table('mdl_attendance_sessions')
        ->where('id', $sessionId)
        ->first(['id', 'attendanceid', 'sessdate']);

        $cm = CourseModule::where('instance', $session->attendanceid)
        ->where('module', $module->id)
        ->where('course', $course->id)
        ->first();

        $ctx = Context::where('contextlevel', 70)->where('instanceid', $cm->id)->first();

        $attendance_statusses = DB::connection('moodle_mysql')->table('mdl_attendance_statuses')
        ->where('attendanceid', $session->attendanceid)
        ->get();

        $attendance_log = DB::connection('moodle_mysql')->table('mdl_attendance_log')
        ->where('sessionid', $sessionId)
        ->get();
---
select * from "mdl_course" where "shortname" = 'krs-1' limit 1
select * from "mdl_modules" where "name" = 'attendance' limit 1
select * from "mdl_role" where "shortname" = 'student' limit 1
select "id", "attendanceid", "sessdate" from "mdl_attendance_sessions" where "id" = '1' limit 1
select * from "mdl_course_modules" where "instance" = 1 and "module" = 25 and "course" = 2 limit 1
select * from "mdl_context" where "contextlevel" = 70 and "instanceid" = 3 limit 1
select * from "mdl_attendance_statuses" where "attendanceid" = 1
select * from "mdl_attendance_log" where "sessionid" = '1'