app/Http/Controllers/API/Activity/QuizController.php

    public function findById(Quiz $quiz){
        $instance = new \stdClass();

        $instance->id = $quiz->id;
        $instance->name = $quiz->name;
        $instance->description = $quiz->intro;

        $start = Carbon::createFromTimestamp($quiz->timeopen)->timezone('Asia/Makassar');
        $end = Carbon::createFromTimestamp($quiz->timeclose)->timezone('Asia/Makassar');

        $instance->start_date = $start->translatedFormat('Y-m-d');
        $instance->end_date = $end->translatedFormat('Y-m-d');

        $instance->start_time = $start->translatedFormat('H:i');
        $instance->end_time = $end->translatedFormat('H:i');

        if($start->diffInDays($end) == 0){
            $instance->time_type = 'time';
        } else {
            $instance->time_type = 'date';
        }

        if ($quiz->timelimit % 3600 == 0) {
            $instance->time_limit_type = 'hour';
            $instance->time_limit = $quiz->timelimit / 3600;
        } else {
            $instance->time_limit_type = 'minute';
            $instance->time_limit = $quiz->timelimit / 60;
        }

        $cm = CourseModule::where('instance', $quiz->id)
        ->where('module', Module::where('name', 'quiz')->first()->id)
        ->where('course', $quiz->course)
        ->first();

        $cs = CourseSection::where('id', $cm->section)->first(['section', 'name']);
---
select * from "mdl_course_modules" where "instance" = 1 and "module" = 17 and "course" = 2 limit 1
select "section", "name" from "mdl_course_sections" where "id" = 2 limit 1

    public function store(Request $request, $shortname){
        $module = Module::where('name', 'quiz')->first();
---
select * from "mdl_modules" where "name" = 'quiz' limit 1

    public function getQuizDetail(Quiz $quiz){

        $cm = CourseModule::where('instance', $quiz->id)
        ->where('module', Module::where('name', 'quiz')->first()->id)
        ->where('course', $quiz->course)
        ->first();

        $ctx = Context::where('instanceid', $cm->id)->where('contextlevel', 70)->first();

        $role = Role::where('shortname', 'student')->first();
---
select * from `mdl_course_modules` where `instance` = 36 and `module` = 16 and `course` = 9 limit 1
select * from `mdl_context` where `instanceid` = 339 and `contextlevel` = 70 limit 1
select * from `mdl_role` where `shortname` = 'student' limit 1


        $formatted_students = $students->map(function($student) use ($quiz) {

            $quiz_grade = DB::connection('moodle_mysql')->table('mdl_quiz_grades')
            ->where(
                [
                    'userid' => $student->userid,
                    'quiz' => $quiz->id
                ]
            )->first();
---
select * from "mdl_quiz_grades" where ("userid" = 3 and "quiz" = 2) limit 1

    public function getStudentAnswer(Quiz $quiz, $usageid){

        $questions = DB::connection('moodle_mysql')->table('mdl_question_attempts as qa')
        ->joinSub(
            DB::connection('moodle_mysql')->table('mdl_question_attempt_steps')
                ->select('questionattemptid', DB::raw('MAX(sequencenumber) as max_seq'))
                ->groupBy('questionattemptid'),
            'latest',
            'qa.id',
            '=',
            'latest.questionattemptid'
        )
        ->join(
            'mdl_question_attempt_steps as qas',
            function ($join) {
                $join->on('qas.questionattemptid', '=', 'latest.questionattemptid')
                    ->on('qas.sequencenumber', '=', 'latest.max_seq');
            }
        )
        ->join('mdl_question as q', 'q.id', '=', 'qa.questionid')
        ->where('qa.questionusageid', $usageid)
        ->select('qa.*', 'qas.*',  'qas.id as attemptstepid','q.qtype as question_type')
        ->get();

        $quizAttempt = QuizAttempt::where('mdl_quiz_attempts.uniqueid', $usageid)
        ->where('mdl_quiz_attempts.quiz', $quiz->id)
        ->join('mdl_user as u', 'u.id', '=', 'mdl_quiz_attempts.userid')
        ->select([
            'mdl_quiz_attempts.*',
            DB::raw("CONCAT(u.firstname, ' ', u.lastname) as fullname"),
            'u.username as nim',
            'u.id as studentid'
        ])
        ->first();

        $timeStart = Carbon::parse($quizAttempt->timestart);
        $timeFinish = Carbon::parse($quizAttempt->timefinish);

        $quizAttempt->formatted_duration = $timeFinish->diffForHumans($timeStart, CarbonInterface::DIFF_ABSOLUTE);
        $quizAttempt->formatted_date = $timeStart->translatedFormat('d F Y');

        $quiz_grade = DB::connection('moodle_mysql')->table('mdl_quiz_grades')
        ->where(
            [
                'userid' => $quizAttempt->userid,
                'quiz' => $quiz->id
            ]
        )->first();
---
select `qa`.*, `qas`.*, `qas`.`id` as `attemptstepid`, `q`.`qtype` as `question_type` from `mdl_question_attempts` as `qa` inner join (select `questionattemptid`, MAX(sequencenumber) as max_seq from `mdl_question_attempt_steps` group by `questionattemptid`) as `latest` on `qa`.`id` = `latest`.`questionattemptid` inner join `mdl_question_attempt_steps` as `qas` on `qas`.`questionattemptid` = `latest`.`questionattemptid` and `qas`.`sequencenumber` = `latest`.`max_seq` inner join `mdl_question` as `q` on `q`.`id` = `qa`.`questionid` where `qa`.`questionusageid` = '5'
select "mdl_quiz_attempts".*, CONCAT(u.firstname, ' ', u.lastname) as fullname, "u"."username" as "nim", "u"."id" as "studentid" from "mdl_quiz_attempts" inner join "mdl_user" as "u" on "u"."id" = "mdl_quiz_attempts"."userid" where "mdl_quiz_attempts"."uniqueid" = '3' and "mdl_quiz_attempts"."quiz" = 2 limit 1
select * from "mdl_quiz_grades" where ("userid" = 3 and "quiz" = 2) limit 1

    public function getQuizDetailForStudent(Request $request, Quiz $quiz){

        $cm = CourseModule::where('instance', $quiz->id)
        ->where('module', Module::where('name', 'quiz')->first()->id)
        ->where('course', $quiz->course)
        ->first();

        $instance = new stdClass();
        $instance->name = $quiz->name;
        $instance->description = $quiz->intro;
        $instance->timeclose = $quiz->timeclose == 0 ? "-" : Carbon::parse($quiz->timeclose)->timezone('Asia/Makassar')->translatedFormat('d-m-Y H:i');
        $instance->duration = ($quiz->timelimit / 60) . " Menit";

        $quiz_attempt = QuizAttempt::where('quiz', $quiz->id)
        ->where('userid', $request->user()->id)
        ->first();

        $instance->status = null;

        if($quiz_attempt){
            $timeStart = Carbon::parse($quiz_attempt->timestart);
            $timeFinish = Carbon::parse($quiz_attempt->timefinish);
            $instance->duration = $timeFinish->diffForHumans($timeStart, CarbonInterface::DIFF_ABSOLUTE);
            $instance->status = $quiz_attempt->state;

            $quiz_grade = DB::connection('moodle_mysql')->table('mdl_quiz_grades')
            ->where(
                [
                    'userid' => $request->user()->id,
                    'quiz' => $quiz->id
                ]
            )->first();
---
select * from "mdl_course_modules" where "instance" = 5041 and "module" = 16 and "course" = 17651 limit 1
select * from "mdl_quiz_attempts" where "quiz" = 5041 and "userid" = 58854 limit 1
select * from "mdl_quiz_grades" where ("userid" = 3 and "quiz" = 2) limit 1

    public function getBankQuestion(Request $request, $shortname){

        $perpage = $request->query('perpage') ?? 10;

        $course = Course::where('shortname', $shortname)->first();

        $ctx = Context::where('instanceid', $course->id)->where('contextlevel', 50)->first();

        $categories = DB::connection('moodle_mysql')->table('mdl_question_categories')
        ->where('contextid', $ctx->id)
        ->orderBy('id', 'DESC')
        ->get();

        if(!$categories){

        }

        $res = DB::connection('moodle_mysql')->table('mdl_question as q')
            ->join('mdl_question_versions as qv', 'qv.questionid', '=', 'q.id')
            ->join('mdl_question_bank_entries as qbe', 'qbe.id', '=', 'qv.questionbankentryid')
            ->join('mdl_question_categories as qc', 'qc.id', '=', 'qbe.questioncategoryid')
            ->where('q.parent', 0)
            ->where(function ($subQuery) {
                $subQuery->where('qv.status', 'ready')
                        ->orWhere('qv.status', 'draft');
            })
            ->when(count($categories) > 0, function($q) use ($categories){
                $q->where('qbe.questioncategoryid', $categories[0]->id);
            })
            ->whereRaw('qv.version = (SELECT MAX(v.version)
                                        FROM mdl_question_versions v
                                        JOIN mdl_question_bank_entries be
                                        ON be.id = v.questionbankentryid
                                        WHERE be.id = qbe.id)')
            ->orderBy('q.qtype', 'asc')
            ->orderBy('q.name', 'asc')
            ->select([
                'qv.status',
                'qc.id as categoryid',
                'qv.version',
                'qv.id as versionid',
                'qbe.id as questionbankentryid',
                'q.id',
                'q.qtype',
                'q.name',
                'qbe.idnumber',
                'q.createdby',
                'qc.contextid',
                'q.timecreated',
                'q.timemodified',
            ])
        ->paginate($perpage);
---
select * from "mdl_course" where "shortname" = 'web-1' limit 1
select * from "mdl_context" where "instanceid" = 3 and "contextlevel" = 50 limit 1
select * from `mdl_question_categories` where `contextid` = 309 order by `id` desc
select count(*) as aggregate from `mdl_question` as `q` inner join `mdl_question_versions` as `qv` on `qv`.`questionid` = `q`.`id` inner join `mdl_question_bank_entries` as `qbe` on `qbe`.`id` = `qv`.`questionbankentryid` inner join `mdl_question_categories` as `qc` on `qc`.`id` = `qbe`.`questioncategoryid` where `q`.`parent` = 0 and (`qv`.`status` = 'ready' or `qv`.`status` = 'draft') and `qbe`.`questioncategoryid` = 22 and qv.version = (SELECT MAX(v.version)
FROM mdl_question_versions v
JOIN mdl_question_bank_entries be
ON be.id = v.questionbankentryid
WHERE be.id = qbe.id)
select "qv"."status", "qc"."id" as "categoryid", "qv"."version", "qv"."id" as "versionid", "qbe"."id" as "questionbankentryid", "q"."id", "q"."qtype", "q"."name", "qbe"."idnumber", "q"."createdby", "qc"."contextid", "q"."timecreated", "q"."timemodified" from "mdl_question" as "q" inner join "mdl_question_versions" as "qv" on "qv"."questionid" = "q"."id" inner join "mdl_question_bank_entries" as "qbe" on "qbe"."id" = "qv"."questionbankentryid" inner join "mdl_question_categories" as "qc" on "qc"."id" = "qbe"."questioncategoryid" where "q"."parent" = 0 and ("qv"."status" = 'ready' or "qv"."status" = 'draft') and "qbe"."questioncategoryid" = 12 and qv.version = (SELECT MAX(v.version)
FROM mdl_question_versions v
JOIN mdl_question_bank_entries be
ON be.id = v.questionbankentryid
WHERE be.id = qbe.id) order by "q"."qtype" asc, "q"."name" asc limit 10 offset 0