app/Http/Controllers/API/Activity/UrlController.php

select * from "mdl_modules" where "name" = 'url' limit 1
select * from "mdl_course" where "shortname" = 'RPL' limit 1
---
    public function store(Request $request, $shortname){

        $module = Module::where('name', 'url')->first();
        $course = Course::where('shortname', $shortname)->first();